/*Задача 41: Написать программу, которая из имеющегося массива строк формирует
 новый массив из строк, длинна которых меньше или равна 3.*/
Console.WriteLine("Hello, World!");
